# Prot_GetUsedSeatsNum

## Description
Returns the number of running Vectorworks on the network.

```pascal
FUNCTION Prot_GetUsedSeatsNum : INTEGER;
```

```python
def vs.Prot_GetUsedSeatsNum():
    return INTEGER
```

## Version
Availability: from Vectorworks 2015

## Category
* Protection